# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\munee\OneDrive\Documents\cypress\CY8C_149KIT\HomeAutomation.cydsn\HomeAutomation.cyprj
# Date: Thu, 02 Aug 2018 18:02:37 GMT
#set_units -time ns
create_clock -name {bridging_console_SCBCLK(FFB)} -period 2166.6666666666665 -waveform {0 1083.33333333333} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {console_SCBCLK(FFB)} -period 2166.6666666666665 -waveform {0 1083.33333333333} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {bridging_console_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list]
create_generated_clock -name {console_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list]


# Component constraints for C:\Users\munee\OneDrive\Documents\cypress\CY8C_149KIT\HomeAutomation.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\munee\OneDrive\Documents\cypress\CY8C_149KIT\HomeAutomation.cydsn\HomeAutomation.cyprj
# Date: Thu, 02 Aug 2018 18:02:37 GMT
